JZ-Y/rtthread_stm32f429_407/bsp/stm32/stm32f429--demo/board/CubeMX_Config/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define IIC_SDA_PE2_Pin GPIO_PIN_2
#define IIC_SDA_PE2_GPIO_Port GPIOE
#define IIC_SCL_PF8_Pin GPIO_PIN_8
#define IIC_SCL_PF8_GPIO_Port GPIOF
#define HMI_UART7_RX_Pin GPIO_PIN_7
#define HMI_UART7_RX_GPIO_Port GPIOE
#define HMI_UART7_TX_Pin GPIO_PIN_8
#define HMI_UART7_TX_GPIO_Port GPIOE
#define CO2_USART3_TX_Pin GPIO_PIN_8
#define CO2_USART3_TX_GPIO_Port GPIOD
#define CO2_USART3_RX_Pin GPIO_PIN_9
#define CO2_USART3_RX_GPIO_Port GPIOD
#define CO2_USART3_DE_Pin GPIO_PIN_9
#define CO2_USART3_DE_GPIO_Port GPIOC
#define PA8_CARD_SEL_Pin GPIO_PIN_8
#define PA8_CARD_SEL_GPIO_Port GPIOA
#define UART4_DE_Pin GPIO_PIN_0
#define UART4_DE_GPIO_Port GPIOD
#define VALVE_PD5_Pin GPIO_PIN_5
#define VALVE_PD5_GPIO_Port GPIOD
#define AF_USART1_TX_Pin GPIO_PIN_6
#define AF_USART1_TX_GPIO_Port GPIOB
#define AF_USART1_RX_Pin GPIO_PIN_7
#define AF_USART1_RX_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
